21mw12/CW32_Voltammeter/电压电流表资料/4 进阶程序/电压电流表程序7.1（原始电压电流同时显示 有跳动现象）/Driver/cw32f003_gpio.h
//============================================================
// AF0 - AF7
#define PA00_AFx_GPIO()                 (CW_GPIOA->AFRL_f.AFR0=0)
#define PA00_AFx_UART1RXD()             (CW_GPIOA->AFRL_f.AFR0=1)
#define PA00_AFx_UART2RTS()             (CW_GPIOA->AFRL_f.AFR0=2)
#define PA00_AFx_SPISCK()               (CW_GPIOA->AFRL_f.AFR0=3)
#define PA00_AFx_ATIMCH3A()             (CW_GPIOA->AFRL_f.AFR0=4)
#define PA00_AFx_GTIMCH4()              (CW_GPIOA->AFRL_f.AFR0=5)
#define PA00_AFx_BTIM1TOGN()            (CW_GPIOA->AFRL_f.AFR0=6)
#define PA00_AFx_VC1OUT()               (CW_GPIOA->AFRL_f.AFR0=7)
#define PA01_AFx_GPIO()                 (CW_GPIOA->AFRL_f.AFR1=0)
#define PA01_AFx_UART2TXD()             (CW_GPIOA->AFRL_f.AFR1=1)
#define PA01_AFx_VC2OUT()               (CW_GPIOA->AFRL_f.AFR1=2)
#define PA01_AFx_SPIMOSI()              (CW_GPIOA->AFRL_f.AFR1=3)
#define PA01_AFx_ATIMCH3B()             (CW_GPIOA->AFRL_f.AFR1=4)
#define PA01_AFx_GTIMCH1()              (CW_GPIOA->AFRL_f.AFR1=5)
#define PA01_AFx_BTIM2TOGP()            (CW_GPIOA->AFRL_f.AFR1=6)
#define PA01_AFx_MCOOUT()               (CW_GPIOA->AFRL_f.AFR1=7)
#define PA02_AFx_GPIO()                 (CW_GPIOA->AFRL_f.AFR2=0)
#define PA02_AFx_UART1RXD()             (CW_GPIOA->AFRL_f.AFR2=1)
#define PA02_AFx_UART2TXD()             (CW_GPIOA->AFRL_f.AFR2=2)
#define PA02_AFx_I2CSDA()               (CW_GPIOA->AFRL_f.AFR2=3)
#define PA02_AFx_GTIMETR()              (CW_GPIOA->AFRL_f.AFR2=4)
#define PA02_AFx_GTIMCH3()              (CW_GPIOA->AFRL_f.AFR2=5)
#define PA02_AFx_VC2OUT()               (CW_GPIOA->AFRL_f.AFR2=6)
#define PA02_AFx_AWTETR()               (CW_GPIOA->AFRL_f.AFR2=7)
#define PA03_AFx_GPIO()                 (CW_GPIOA->AFRL_f.AFR3=0)
#define PA03_AFx_UART2TXD()             (CW_GPIOA->AFRL_f.AFR3=1)
#define PA03_AFx_UART1RXD()             (CW_GPIOA->AFRL_f.AFR3=2)
#define PA03_AFx_PCLKOUT()              (CW_GPIOA->AFRL_f.AFR3=3)
#define PA03_AFx_ATIMBK()               (CW_GPIOA->AFRL_f.AFR3=4)
#define PA03_AFx_GTIMETR()              (CW_GPIOA->AFRL_f.AFR3=5)
#define PA03_AFx_BTIM2TOGP()            (CW_GPIOA->AFRL_f.AFR3=6)
#define PA03_AFx_LVDOUT()               (CW_GPIOA->AFRL_f.AFR3=7)
#define PA04_AFx_GPIO()                 (CW_GPIOA->AFRL_f.AFR4=0)
#define PA04_AFx_UART1RXD()             (CW_GPIOA->AFRL_f.AFR4=1)
#define PA04_AFx_IROUT()                (CW_GPIOA->AFRL_f.AFR4=2)
#define PA04_AFx_SPIMISO()              (CW_GPIOA->AFRL_f.AFR4=3)
#define PA04_AFx_ATIMCH3B()             (CW_GPIOA->AFRL_f.AFR4=4)
#define PA04_AFx_GTIMCH2()              (CW_GPIOA->AFRL_f.AFR4=5)
#define PA04_AFx_BTIM2TOGN()            (CW_GPIOA->AFRL_f.AFR4=6)
#define PA04_AFx_GTIMETR()              (CW_GPIOA->AFRL_f.AFR4=7)
#define PA05_AFx_GPIO()                 (CW_GPIOA->AFRL_f.AFR5=0)
#define PA05_AFx_UART1TXD()             (CW_GPIOA->AFRL_f.AFR5=1)
#define PA05_AFx_UART2RXD()             (CW_GPIOA->AFRL_f.AFR5=2)
#define PA05_AFx_I2CSCL()               (CW_GPIOA->AFRL_f.AFR5=3)
#define PA05_AFx_GTIMCH4()              (CW_GPIOA->AFRL_f.AFR5=5)
#define PA05_AFx_BTIMETR()              (CW_GPIOA->AFRL_f.AFR5=6)
#define PA05_AFx_MCOOUT()               (CW_GPIOA->AFRL_f.AFR5=7)
#define PA06_AFx_GPIO()                 (CW_GPIOA->AFRL_f.AFR6=0)
#define PA06_AFx_UART1CTS()             (CW_GPIOA->AFRL_f.AFR6=1)
#define PA06_AFx_UART2TXD()             (CW_GPIOA->AFRL_f.AFR6=2)
#define PA06_AFx_I2CSDA()               (CW_GPIOA->AFRL_f.AFR6=3)
#define PA06_AFx_ATIMCH2B()             (CW_GPIOA->AFRL_f.AFR6=4)
#define PA06_AFx_GTIMCH3()              (CW_GPIOA->AFRL_f.AFR6=5)
#define PA06_AFx_BTIM3TOGP()            (CW_GPIOA->AFRL_f.AFR6=6)
#define PA06_AFx_LVDOUT()               (CW_GPIOA->AFRL_f.AFR6=7)
#define PA07_AFx_GPIO()                 (CW_GPIOA->AFRL_f.AFR7=0)
#define PA07_AFx_UART1RTS()             (CW_GPIOA->AFRL_f.AFR7=1)
#define PA07_AFx_UART2RXD()             (CW_GPIOA->AFRL_f.AFR7=2)
#define PA07_AFx_VC1OUT()               (CW_GPIOA->AFRL_f.AFR7=3)
#define PA07_AFx_ATIMCH1B()             (CW_GPIOA->AFRL_f.AFR7=4)
#define PA07_AFx_GTIMCH4()              (CW_GPIOA->AFRL_f.AFR7=5)
#define PA07_AFx_BTIM3TOGN()            (CW_GPIOA->AFRL_f.AFR7=6)
#define PA07_AFx_ATIMBK()               (CW_GPIOA->AFRL_f.AFR7=7)
#define PB00_AFx_GPIO()                 (CW_GPIOB->AFRL_f.AFR0=0)
#define PB00_AFx_UART1RXD()             (CW_GPIOB->AFRL_f.AFR0=1)
#define PB00_AFx_I2CSDA()               (CW_GPIOB->AFRL_f.AFR0=2)
#define PB00_AFx_SPICS()                (CW_GPIOB->AFRL_f.AFR0=3)
#define PB00_AFx_ATIMCH1B()             (CW_GPIOB->AFRL_f.AFR0=4)
#define PB00_AFx_GTIMCH1()              (CW_GPIOB->AFRL_f.AFR0=5)
#define PB00_AFx_GTIMTOGP()             (CW_GPIOB->AFRL_f.AFR0=6)
#define PB00_AFx_AWTETR()               (CW_GPIOB->AFRL_f.AFR0=7)
#define PB01_AFx_GPIO()                 (CW_GPIOB->AFRL_f.AFR1=0)
#define PB01_AFx_UART1TXD()             (CW_GPIOB->AFRL_f.AFR1=1)
#define PB01_AFx_LVDOUT()               (CW_GPIOB->AFRL_f.AFR1=2)
#define PB01_AFx_I2CSCL()               (CW_GPIOB->AFRL_f.AFR1=3)
#define PB01_AFx_ATIMBK()               (CW_GPIOB->AFRL_f.AFR1=4)
#define PB01_AFx_GTIMCH2()              (CW_GPIOB->AFRL_f.AFR1=5)
#define PB01_AFx_GTIMTOGN()             (CW_GPIOB->AFRL_f.AFR1=6)
#define PB01_AFx_AWTETR()               (CW_GPIOB->AFRL_f.AFR1=7)
#define PB02_AFx_GPIO()                 (CW_GPIOB->AFRL_f.AFR2=0)
#define PB02_AFx_UART1TXD()             (CW_GPIOB->AFRL_f.AFR2=1)
#define PB02_AFx_UART2CTS()             (CW_GPIOB->AFRL_f.AFR2=2)
#define PB02_AFx_SPICS()                (CW_GPIOB->AFRL_f.AFR2=3)
#define PB02_AFx_ATIMCH2B()             (CW_GPIOB->AFRL_f.AFR2=4)
#define PB02_AFx_GTIMCH3()              (CW_GPIOB->AFRL_f.AFR2=5)
#define PB02_AFx_BTIM1TOGP()            (CW_GPIOB->AFRL_f.AFR2=6)
#define PB02_AFx_MCOOUT()               (CW_GPIOB->AFRL_f.AFR2=7)
#define PB03_AFx_GPIO()                 (CW_GPIOB->AFRL_f.AFR3=0)
#define PB03_AFx_UART2RXD()             (CW_GPIOB->AFRL_f.AFR3=1)
#define PB03_AFx_I2CSDA()               (CW_GPIOB->AFRL_f.AFR3=2)
#define PB03_AFx_PCLKOUT()              (CW_GPIOB->AFRL_f.AFR3=3)
#define PB03_AFx_ATIMCH2A()             (CW_GPIOB->AFRL_f.AFR3=4)
#define PB03_AFx_GTIMCH2()              (CW_GPIOB->AFRL_f.AFR3=5)
#define PB03_AFx_BTIM3TOGP()            (CW_GPIOB->AFRL_f.AFR3=6)
#define PB03_AFx_IROUT()                (CW_GPIOB->AFRL_f.AFR3=7)
#define PB04_AFx_GPIO()                 (CW_GPIOB->AFRL_f.AFR4=0)
#define PB04_AFx_UART2TXD()             (CW_GPIOB->AFRL_f.AFR4=1)
#define PB04_AFx_I2CSCL()               (CW_GPIOB->AFRL_f.AFR4=2)
#define PB04_AFx_GTIMETR()              (CW_GPIOB->AFRL_f.AFR4=3)
#define PB04_AFx_ATIMETR()              (CW_GPIOB->AFRL_f.AFR4=4)
#define PB04_AFx_GTIMCH1()              (CW_GPIOB->AFRL_f.AFR4=5)
#define PB04_AFx_BTIM3TOGN()            (CW_GPIOB->AFRL_f.AFR4=6)
#define PB04_AFx_ATIMBK()               (CW_GPIOB->AFRL_f.AFR4=7)
#define PB05_AFx_GPIO()                 (CW_GPIOB->AFRL_f.AFR5=0)
#define PB05_AFx_UART1RXD()             (CW_GPIOB->AFRL_f.AFR5=1)
#define PB05_AFx_I2CSDA()               (CW_GPIOB->AFRL_f.AFR5=2)
#define PB05_AFx_BTIMETR()              (CW_GPIOB->AFRL_f.AFR5=3)
#define PB05_AFx_ATIMCH1B()             (CW_GPIOB->AFRL_f.AFR5=4)
#define PB05_AFx_GTIMTOGN()             (CW_GPIOB->AFRL_f.AFR5=5)
#define PB05_AFx_BTIM2TOGN()            (CW_GPIOB->AFRL_f.AFR5=6)
#define PB05_AFx_ATIMBK()               (CW_GPIOB->AFRL_f.AFR5=7)
#define PB06_AFx_GPIO()                 (CW_GPIOB->AFRL_f.AFR6=0)
#define PB06_AFx_UART1TXD()             (CW_GPIOB->AFRL_f.AFR6=1)
#define PB06_AFx_I2CSCL()               (CW_GPIOB->AFRL_f.AFR6=2)
#define PB06_AFx_SPICS()                (CW_GPIOB->AFRL_f.AFR6=3)
#define PB06_AFx_ATIMCH1A()             (CW_GPIOB->AFRL_f.AFR6=4)
#define PB06_AFx_GTIMTOGP()             (CW_GPIOB->AFRL_f.AFR6=5)
#define PB06_AFx_BTIM2TOGP()            (CW_GPIOB->AFRL_f.AFR6=6)
#define PB06_AFx_HCLKOUT()              (CW_GPIOB->AFRL_f.AFR6=7)
#define PB07_AFx_GPIO()                 (CW_GPIOB->AFRL_f.AFR7=0)
#define PB07_AFx_UART2RXD()             (CW_GPIOB->AFRL_f.AFR7=1)
#define PB07_AFx_UART1TXD()             (CW_GPIOB->AFRL_f.AFR7=2)
#define PB07_AFx_SPISCK()               (CW_GPIOB->AFRL_f.AFR7=3)
#define PB07_AFx_GTIMCH1()              (CW_GPIOB->AFRL_f.AFR7=5)
#define PB07_AFx_BTIM2TOGN()            (CW_GPIOB->AFRL_f.AFR7=6)
#define PB07_AFx_BTIMETR()              (CW_GPIOB->AFRL_f.AFR7=7)
#define PC00_AFx_GPIO()                 (CW_GPIOC->AFRL_f.AFR0=0)
#define PC00_AFx_UART2RXD()             (CW_GPIOC->AFRL_f.AFR0=1)
#define PC00_AFx_UART1TXD()             (CW_GPIOC->AFRL_f.AFR0=2)
#define PC00_AFx_SPISCK()               (CW_GPIOC->AFRL_f.AFR0=3)
#define PC00_AFx_ATIMCH1A()             (CW_GPIOC->AFRL_f.AFR0=4)
#define PC00_AFx_GTIMCH2()              (CW_GPIOC->AFRL_f.AFR0=5)
#define PC00_AFx_BTIM1TOGP()            (CW_GPIOC->AFRL_f.AFR0=6)
#define PC00_AFx_HCLKOUT()              (CW_GPIOC->AFRL_f.AFR0=7)
#define PC01_AFx_GPIO()                 (CW_GPIOC->AFRL_f.AFR1=0)
#define PC01_AFx_UART2TXD()             (CW_GPIOC->AFRL_f.AFR1=1)
#define PC01_AFx_GTIMETR()              (CW_GPIOC->AFRL_f.AFR1=2)
#define PC01_AFx_SPIMISO()              (CW_GPIOC->AFRL_f.AFR1=3)
#define PC01_AFx_ATIMCH2A()             (CW_GPIOC->AFRL_f.AFR1=4)
#define PC01_AFx_GTIMCH3()              (CW_GPIOC->AFRL_f.AFR1=5)
#define PC01_AFx_BTIM1TOGN()            (CW_GPIOC->AFRL_f.AFR1=6)
#define PC01_AFx_VC1OUT()               (CW_GPIOC->AFRL_f.AFR1=7)
#define PC02_AFx_GPIO()                 (CW_GPIOC->AFRL_f.AFR2=0)
#define PC02_AFx_UART2RXD()             (CW_GPIOC->AFRL_f.AFR2=1)
#define PC02_AFx_IROUT()                (CW_GPIOC->AFRL_f.AFR2=2)
#define PC02_AFx_SPIMOSI()              (CW_GPIOC->AFRL_f.AFR2=3)
#define PC02_AFx_ATIMCH3A()             (CW_GPIOC->AFRL_f.AFR2=4)
#define PC02_AFx_GTIMCH4()              (CW_GPIOC->AFRL_f.AFR2=5)
#define PC02_AFx_HCLKOUT()              (CW_GPIOC->AFRL_f.AFR2=6)
#define PC02_AFx_AWTETR()               (CW_GPIOC->AFRL_f.AFR2=7)
#define PC03_AFx_GPIO()                 (CW_GPIOC->AFRL_f.AFR3=0)
#define PC03_AFx_UART1TXD()             (CW_GPIOC->AFRL_f.AFR3=1)
#define PC03_AFx_SPICS()                (CW_GPIOC->AFRL_f.AFR3=2)
#define PC03_AFx_SPIMISO()              (CW_GPIOC->AFRL_f.AFR3=3)
#define PC03_AFx_ATIMCH3B()             (CW_GPIOC->AFRL_f.AFR3=4)
#define PC03_AFx_GTIMCH3()              (CW_GPIOC->AFRL_f.AFR3=5)
#define PC03_AFx_GTIMTOGP()             (CW_GPIOC->AFRL_f.AFR3=6)
#define PC03_AFx_ATIMBK()               (CW_GPIOC->AFRL_f.AFR3=7)
#define PC04_AFx_GPIO()                 (CW_GPIOC->AFRL_f.AFR4=0)
#define PC04_AFx_UART1RXD()             (CW_GPIOC->AFRL_f.AFR4=1)
#define PC04_AFx_IROUT()                (CW_GPIOC->AFRL_f.AFR4=2)
#define PC04_AFx_SPIMOSI()              (CW_GPIOC->AFRL_f.AFR4=3)
#define PC04_AFx_ATIMCH2B()             (CW_GPIOC->AFRL_f.AFR4=4)
#define PC04_AFx_GTIMCH4()              (CW_GPIOC->AFRL_f.AFR4=5)
#define PC04_AFx_GTIMTOGN()             (CW_GPIOC->AFRL_f.AFR4=6)

/******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
 
 
/******************************************************************************
 * Global function prototypes 
 ******************************************************************************/

void GPIO_SWD2GPIO(void);
void GPIO_GPIO2SWD(void);
void GPIO_NRST2GPIO(void);
void GPIO_GPIO2NRST(void);
void GPIO_DeInit(GPIO_TypeDef *GPIOx, uint32_t GPIO_Pins);
void GPIO_Init(GPIO_TypeDef *GPIOx, GPIO_InitTypeDef *GPIO_Init);
void GPIO_ConfigFilter(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins, uint32_t FltClk);
void GPIO_WritePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins, GPIO_PinState PinState);
// void GPIO_LowByte_Write(GPIO_TypeDef *GPIOx, uint8_t Value);
void GPIO_TogglePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pins);
GPIO_PinState GPIO_ReadPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);

#ifdef __cplusplus
}
#endif

#endif /*__CW32F003_GPIO_H */


